_load-test/http/break-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 5 # five seconds
      arrivalRate: 100 # 20 fake users per second
    - duration: 5 # five seconds
      arrivalRate: 200 # 20 fake users per second
    - duration: 5 # five seconds
      arrivalRate: 400 # 20 fake users per second
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"