_load-test/http/heavy-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10 
      arrivalRate: 0 
      rampTo: 500
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to signup/"
    - post:
        url: "/profiles"
        headers:
          Authorization: "Bearer {{ token }}"
        json:
          bio: "{{ bio }}"
          avatar: "{{ avatar }}"
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
    - log : "Sent a request to profiles/"