_load-test/http/simple-load.yml
config:
  target: 'https://firepolls-back-production.herokuapp.com'
  phases:
    - duration: 5 # five seconds
      arrivalRate: 10 # 20 fake users per second
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"