_load-test/http/simple-load.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 5 # five seconds
      arrivalRate: 20 # 20 fake users per second
    - duration: 5 # five seconds
      arrivalRate: 40 # 20 fake users per second
    - duration: 5 # five seconds
      arrivalRate: 80 # 20 fake users per second
scenarios:
  - flow:
    - post:
        url: "/signup"
        json:
          username: 'marioooonew'
          email: 'marionewnew@mario.com'
          password: 'mario'